In [9]:
import pandas as pd 
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [13]:
emp=pd.Series(['parker', 'jhon','smith','william'])
id=pd.Series([102,107,109,114])
frame={'Emp':emp,'id':id}
result=pd.DataFrame(frame)
print(result)

       Emp   id
0   parker  102
1     jhon  107
2    smith  109
3  william  114

In [14]:
#extracting one column 
result['age']=pd.Series([35,24,40,380])
print(result)

       Emp   id  age
0   parker  102   35
1     jhon  107   24
2    smith  109   40
3  william  114  380

In [15]:
#deleting a new column 
del result['age']
print(result)

       Emp   id
0   parker  102
1     jhon  107
2    smith  109
3  william  114

In [17]:
#extracrting the third row 
print(result.loc[1])

Emp    jhon
id      107
Name: 1, dtype: object

In [18]:
#slicing 
print(result[1:3])

     Emp   id
1   jhon  107
2  smith  109

In [24]:
import pandas as pd 
import numpy as np
#data frmae . apply function 
info=pd.DataFrame([[2,7]]*3,columns=['p','q'])
print(info)
print("\n square root of data frame :\n",info.apply(np.sqrt))
print("\n sum of each column:\n",info.apply(np.sum,axis=0))
print("\n sum of ach row :\n",info.apply(np.sum,axis=1))

   p  q
0  2  7
1  2  7
2  2  7

 square root of data frame :
           p         q
0  1.414214  2.645751
1  1.414214  2.645751
2  1.414214  2.645751

 sum of each column:
 p     6
q    21
dtype: int64

 sum of ach row :
 0    9
1    9
2    9
dtype: int64

In [29]:
info=pd.DataFrame([[1,5,7],[2,7,8],[3,6,9]],columns=['X','Y','Z'])
print(info)

   X  Y  Z
0  1  5  7
1  2  7  8
2  3  6  9

In [31]:
#data frame .assign function 
d2=pd.DataFrame([['Dale',123],['mark',143]],columns=['Emp','id'])
print(d2)

    Emp   id
0  Dale  123
1  mark  143

In [32]:
d2['age']=[35,40]
print(d2)

    Emp   id  age
0  Dale  123   35
1  mark  143   40

In [34]:
#adding a new column 
d=d2.assign(sex=['male','male'])
print(d)

    Emp   id  age   sex
0  Dale  123   35  male
1  mark  143   40  male

In [39]:
#DataFrme.sort function 
info=pd.DataFrame(np.random.randn(5,2),index=[3,2,0,4,1],columns=['col3','col4'])
print(info)

#sort by index 
info2=info.sort_index()
print("\n Sort index\n :",info2)

#sort by value
info3=info.sort_values(by='col3')
print('\n sort values :\n',info3)

       col3      col4
3  0.812693  0.377551
2 -1.068750 -0.767255
0 -0.943080  0.659934
4 -1.420553 -1.567189
1  0.295467  0.020441

 Sort index
 :        col3      col4
0 -0.943080  0.659934
1  0.295467  0.020441
2 -1.068750 -0.767255
3  0.812693  0.377551
4 -1.420553 -1.567189

 sort values :
        col3      col4
4 -1.420553 -1.567189
2 -1.068750 -0.767255
0 -0.943080  0.659934
1  0.295467  0.020441
3  0.812693  0.377551

In [20]:
left=pd.DataFrame({
    'id':[1,2,3,4,5],
    'Name':['Alex','Amy','Allen','Alice','Ayoung'],
    'sub':['sub1','sub2','sub4','sub6','sub5']})
right=pd.DataFrame({
    'id':[1,2,3,4,5],
    'Name':['Billy','Brain','Bran','Bryce','Betty'],
    'sub':['sub2','sub4','sub3','sub6','sub5']})
print(pd.merge(left,right,on='id'))

   id  Name_x sub_x Name_y sub_y
0   1    Alex  sub1  Billy  sub2
1   2     Amy  sub2  Brain  sub4
2   3   Allen  sub4   Bran  sub3
3   4   Alice  sub6  Bryce  sub6
4   5  Ayoung  sub5  Betty  sub5

In [25]:
#pandas series 
import pandas as pd
import numpy as np
arr=np.array(['p','a','n','d','a','s'])
print(arr)

#series from dictnary 
arr={'x':0.,'y':1.,'z':2}
b=pd.Series(arr)
print(b)

['p' 'a' 'n' 'd' 'a' 's']
x    0.0
y    1.0
z    2.0
dtype: float64

In [26]:
#Series using scalar 
x=pd.Series(4,index=[0,1,2,3])
print("\n Series using scalar\n ")
print(x)

 Series using scalar

0    4
1    4
2    4
3    4
dtype: int64

In [27]:
#series through index 
x=pd.Series(data=[1,2,3,4])
print(x)

0    1
1    2
2    3
3    4
dtype: int64

In [34]:
#LOAD
import pandas as pd
d=pd.read_csv(r"C:\Users\Tcs\Downloads\employees - employees.csv")
print(d)

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management                  Team
0                True             Marketing
1                True                   NaN
2               False               Finance
3                True               Finance
4                True       Client Services
..                ...                   ...
995             False          Distribution
996             False               Finance
997             False               Product
998             False  Business Development
999              True                 Sales

[1000 rows x 8 columns]

In [35]:
df=pd.DataFrame(d)
print(df)

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management                  Team
0                True             Marketing
1                True                   NaN
2               False               Finance
3                True               Finance
4                True       Client Services
..                ...                   ...
995             False          Distribution
996             False               Finance
997             False               Product
998             False  Business Development
999              True                 Sales

[1000 rows x 8 columns]

In [ ]:
print("\